#### EdgeEndPoint Members

---

|  |
| --- |
| EdgeEndPoint Class   Constructors   Methods   Properties   See Also |

The  EdgeEndPoint  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | EdgeEndPoint(EdgeEndPoint) | Creates a copy of the given EdgeEndPoint instance. |
| Public method | EdgeEndPoint(Edge, Int32) | Constructs an instance of EdgeEndPoint. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  EdgeEndPoint |
| Public method | Equals(Object) | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | Equals(EdgeEndPoint) | Determines whether this EdgeEndPoint is equal to another. |
| Public method | Evaluate | Evaluate the end point of the edge in 3d coordinates. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Edge | The Edge. |
| Public property | Index | The index of the start or the end point of an Edge: 0 is the start point, 1 is the end point. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

EdgeEndPoint Class

Autodesk.Revit.DB Namespace